InformationRegisters/КомпьютерыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>КомпьютерыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоВходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачальныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КомпьютерыПользователей/Forms/ФормаУстановкиСоответствия/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Надпись1.Заголовок = СтрЗаменить(Элементы.Надпись1.Заголовок, "%Комп",         ИмяКомпьютера());
	Элементы.Надпись1.Заголовок = СтрЗаменить(Элементы.Надпись1.Заголовок, "%Пользователь", сабОбщегоНазначения.ТекущийПользователь());
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДаНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.КомпьютерыПользователей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = сабОбщегоНазначения.ТекущийПользователь();
	МенеджерЗаписи.Компьютер    = ИмяКомпьютера();
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Основной = Истина;
	Иначе
		МенеджерЗаписи.Пользователь = сабОбщегоНазначения.ТекущийПользователь();
		МенеджерЗаписи.Компьютер    = ИмяКомпьютера();
		МенеджерЗаписи.Основной = Истина;
	КонецЕсли;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Да(Команда)
	ДаНаСервере();
	Закрыть();
КонецПроцедуры
